{
    "portfolio": [{
            "title": "Blok Tech",
            "description": "Project Tech is a hands-on learning experience where I'll learned about web things like how websites are built, creative coding, and managing projects efficiently. I picked up the skills needed to create, update, and improve modern web applications and websites. Making a beautiful and working matching web application.",
            "grades": [{
                    "title": "Project Tech",
                    "grade": 7.5
                },
                {
                    "title": "Backend development",
                    "grade": 7.1
                },
                {
                    "title": "Frontend development",
                    "grade": 7.4
                }
            ],
            "link-Github": "https://example.com/subject1"
        },
        {
            "title": "information design",
            "description": "Minor Information Design offers a focused program with three essential components: In Data Visualization, students learn to create clear and engaging visualizations using charts, graphs, and maps. The Tech Track provides skills in web technologies to present data effectively online. Through the Integration Project, students collaborate on real-world projects, combining technical expertise and design principles to deliver client solutions.",
            "grades": [{
                    "title": "Datavisualisation",
                    "grade": 7
                },
                {
                    "title": "Tech Track",
                    "grade": 8.3
                },
                {
                    "title": "Project information",
                    "grade": 8
                }
            ],
            "link-Github": "https://example.com/subject1"
        },
        {
            "title": "Web design and development",
            "description": "    The minor Web Design and Development is a hands-on learning experience where I'll learn about web things like how websites are built, creative coding, and managing projects efficiently. I'll pick up the skills needed to create, update, and improve modern web applications and websites. Making a beautiful and working matching web application.",
            "grades": [{
                    "title": "Project Tech",
                    "grade": 0
                }
            ],
            "link-Github": "https://example.com/subject1"
        }
    ]
}